export default (Constants) => ({
	[Constants.DATE_FORMAT]: 'WW, DD.MM.YYYY, hhhh:mm:ss',
	[Constants.WEEK_DAYS]: [
		['Пн', 'Понедельник'],
		['Вт', 'Вторник'],
		['Ср', 'Среда'],
		['Чт', 'Четверг'],
		['Пт', 'Пятница'],
		['Сб', 'Суббота'],
		['Вс', 'Воскресенье']
	],
	[Constants.MONTH_NAMES]: [
		['Янв', 'Январь', 'Января'],
		['Фев', 'Февраль', 'Февраля'],
		['Мар', 'Март', 'Марта'],
		['Апр', 'Апрель', 'Апреля'],
		['Май', 'Май', 'Мая'],
		['Июн', 'Июнь', 'Июня'],
		['Июл', 'Июль', 'Июля'],
		['Авг', 'Август', 'Августа'],
		['Сен', 'Сентябрь', 'Сентября'],
		['Окт', 'Октябрь', 'Октября'],
		['Ноя', 'Ноябрь', 'Ноября'],
		['Дек', 'Декабрь', 'Декабря']
	]
});